MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0TIHB/mcu.h
/**
 *******************************************************************************
 * @file  HC32F4A0TIHB.h
 * @brief Headerfile for HC32F4A0TIHB series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
   2023-01-15       CDT             Modify headfile register address and register name based on reference manual Rev1.13
   2023-09-30       CDT             Modify headfile based on reference manual Rev1.3
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F4A0TIHB_H__
#define __HC32F4A0TIHB_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             1       /*!< HC32F4A0TIHB provides MPU                                */
#define __VTOR_PRESENT            1       /*!< HC32F4A0TIHB supported vector table registers            */
#define __NVIC_PRIO_BITS          4       /*!< HC32F4A0TIHB uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT             1       /*!< FPU present                                          */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum {
    NMI_IRQn             = -14, /*  2 Non Maskable                            */
    HardFault_IRQn       = -13, /*  3 Hard Fault                              */
    MemManageFault_IRQn  = -12, /*  4 MemManage Fault                         */
    BusFault_IRQn        = -11, /*  5 Bus Fault                               */
    UsageFault_IRQn      = -10, /*  6 Usage Fault                             */
    SVC_IRQn             = -5,  /* 11 SVCall                                  */
    DebugMonitor_IRQn    = -4,  /* 12 DebugMonitor                            */
    PendSV_IRQn          = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn         = -1,  /* 15 System Tick                             */
    INT000_IRQn          = 0,
    INT001_IRQn          = 1,
    INT002_IRQn          = 2,
    INT003_IRQn          = 3,
    INT004_IRQn          = 4,
    INT005_IRQn          = 5,
    INT006_IRQn          = 6,
    INT007_IRQn          = 7,
    INT008_IRQn          = 8,
    INT009_IRQn          = 9,
    INT010_IRQn          = 10,
    INT011_IRQn          = 11,
    INT012_IRQn          = 12,
    INT013_IRQn          = 13,
    INT014_IRQn          = 14,
    INT015_IRQn          = 15,
    INT016_IRQn          = 16,
    INT017_IRQn          = 17,
    INT018_IRQn          = 18,
    INT019_IRQn          = 19,
    INT020_IRQn          = 20,
    INT021_IRQn          = 21,
    INT022_IRQn          = 22,
    INT023_IRQn          = 23,
    INT024_IRQn          = 24,
    INT025_IRQn          = 25,
    INT026_IRQn          = 26,
    INT027_IRQn          = 27,
    INT028_IRQn          = 28,
    INT029_IRQn          = 29,
    INT030_IRQn          = 30,
    INT031_IRQn          = 31,
    INT032_IRQn          = 32,
    INT033_IRQn          = 33,
    INT034_IRQn          = 34,
    INT035_IRQn          = 35,
    INT036_IRQn          = 36,
    INT037_IRQn          = 37,
    INT038_IRQn          = 38,
    INT039_IRQn          = 39,
    INT040_IRQn          = 40,
    INT041_IRQn          = 41,
    INT042_IRQn          = 42,
    INT043_IRQn          = 43,
    INT044_IRQn          = 44,
    INT045_IRQn          = 45,
    INT046_IRQn          = 46,
    INT047_IRQn          = 47,
    INT048_IRQn          = 48,
    INT049_IRQn          = 49,
    INT050_IRQn          = 50,
    INT051_IRQn          = 51,
    INT052_IRQn          = 52,
    INT053_IRQn          = 53,
    INT054_IRQn          = 54,
    INT055_IRQn          = 55,
    INT056_IRQn          = 56,
    INT057_IRQn          = 57,
    INT058_IRQn          = 58,
    INT059_IRQn          = 59,
    INT060_IRQn          = 60,
    INT061_IRQn          = 61,
    INT062_IRQn          = 62,
    INT063_IRQn          = 63,
    INT064_IRQn          = 64,
    INT065_IRQn          = 65,
    INT066_IRQn          = 66,
    INT067_IRQn          = 67,
    INT068_IRQn          = 68,
    INT069_IRQn          = 69,
    INT070_IRQn          = 70,
    INT071_IRQn          = 71,
    INT072_IRQn          = 72,
    INT073_IRQn          = 73,
    INT074_IRQn          = 74,
    INT075_IRQn          = 75,
    INT076_IRQn          = 76,
    INT077_IRQn          = 77,
    INT078_IRQn          = 78,
    INT079_IRQn          = 79,
    INT080_IRQn          = 80,
    INT081_IRQn          = 81,
    INT082_IRQn          = 82,
    INT083_IRQn          = 83,
    INT084_IRQn          = 84,
    INT085_IRQn          = 85,
    INT086_IRQn          = 86,
    INT087_IRQn          = 87,
    INT088_IRQn          = 88,
    INT089_IRQn          = 89,
    INT090_IRQn          = 90,
    INT091_IRQn          = 91,
    INT092_IRQn          = 92,
    INT093_IRQn          = 93,
    INT094_IRQn          = 94,
    INT095_IRQn          = 95,
    INT096_IRQn          = 96,
    INT097_IRQn          = 97,
    INT098_IRQn          = 98,
    INT099_IRQn          = 99,
    INT100_IRQn          = 100,
    INT101_IRQn          = 101,
    INT102_IRQn          = 102,
    INT103_IRQn          = 103,
    INT104_IRQn          = 104,
    INT105_IRQn          = 105,
    INT106_IRQn          = 106,
    INT107_IRQn          = 107,
    INT108_IRQn          = 108,
    INT109_IRQn          = 109,
    INT110_IRQn          = 110,
    INT111_IRQn          = 111,
    INT112_IRQn          = 112,
    INT113_IRQn          = 113,
    INT114_IRQn          = 114,
    INT115_IRQn          = 115,
    INT116_IRQn          = 116,
    INT117_IRQn          = 117,
    INT118_IRQn          = 118,
    INT119_IRQn          = 119,
    INT120_IRQn          = 120,
    INT121_IRQn          = 121,
    INT122_IRQn          = 122,
    INT123_IRQn          = 123,
    INT124_IRQn          = 124,
    INT125_IRQn          = 125,
    INT126_IRQn          = 126,
    INT127_IRQn          = 127,
    INT128_IRQn          = 128,
    INT129_IRQn          = 129,
    INT130_IRQn          = 130,
    INT131_IRQn          = 131,
    INT132_IRQn          = 132,
    INT133_IRQn          = 133,
    INT134_IRQn          = 134,
    INT135_IRQn          = 135,
    INT136_IRQn          = 136,
    INT137_IRQn          = 137,
    INT138_IRQn          = 138,
    INT139_IRQn          = 139,
    INT140_IRQn          = 140,
    INT141_IRQn          = 141,
    INT142_IRQn          = 142,
    INT143_IRQn          = 143,

} IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

