MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0TIHB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral RTC
*******************************************************************************/
/*  Bit definition for RTC_CR0 register  */
#define RTC_CR0_RESET                                  (0x01U)

/*  Bit definition for RTC_CR1 register  */
#define RTC_CR1_PRDS_POS                               (0U)
#define RTC_CR1_PRDS                                   (0x07U)
#define RTC_CR1_PRDS_0                                 (0x01U)
#define RTC_CR1_PRDS_1                                 (0x02U)
#define RTC_CR1_PRDS_2                                 (0x04U)
#define RTC_CR1_AMPM_POS                               (3U)
#define RTC_CR1_AMPM                                   (0x08U)
#define RTC_CR1_ONEHZOE_POS                            (5U)
#define RTC_CR1_ONEHZOE                                (0x20U)
#define RTC_CR1_ONEHZSEL_POS                           (6U)
#define RTC_CR1_ONEHZSEL                               (0x40U)
#define RTC_CR1_START_POS                              (7U)
#define RTC_CR1_START                                  (0x80U)

/*  Bit definition for RTC_CR2 register  */
#define RTC_CR2_RWREQ_POS                              (0U)
#define RTC_CR2_RWREQ                                  (0x01U)
#define RTC_CR2_RWEN_POS                               (1U)
#define RTC_CR2_RWEN                                   (0x02U)
#define RTC_CR2_PRDF_POS                               (2U)
#define RTC_CR2_PRDF                                   (0x04U)
#define RTC_CR2_ALMF_POS                               (3U)
#define RTC_CR2_ALMF                                   (0x08U)
#define RTC_CR2_PRDIE_POS                              (5U)
#define RTC_CR2_PRDIE                                  (0x20U)
#define RTC_CR2_ALMIE_POS                              (6U)
#define RTC_CR2_ALMIE                                  (0x40U)
#define RTC_CR2_ALME_POS                               (7U)
#define RTC_CR2_ALME                                   (0x80U)

/*  Bit definition for RTC_CR3 register  */
#define RTC_CR3_LRCEN_POS                              (4U)
#define RTC_CR3_LRCEN                                  (0x10U)
#define RTC_CR3_RCKSEL_POS                             (7U)
#define RTC_CR3_RCKSEL                                 (0x80U)

/*  Bit definition for RTC_SEC register  */
#define RTC_SEC_SECU_POS                               (0U)
#define RTC_SEC_SECU                                   (0x0FU)
#define RTC_SEC_SECD_POS                               (4U)
#define RTC_SEC_SECD                                   (0x70U)

/*  Bit definition for RTC_MIN register  */
#define RTC_MIN_MINU_POS                               (0U)
#define RTC_MIN_MINU                                   (0x0FU)
#define RTC_MIN_MIND_POS                               (4U)
#define RTC_MIN_MIND                                   (0x70U)

/*  Bit definition for RTC_HOUR register  */
#define RTC_HOUR_HOURU_POS                             (0U)
#define RTC_HOUR_HOURU                                 (0x0FU)
#define RTC_HOUR_HOURU_0                               (0x01U)
#define RTC_HOUR_HOURU_1                               (0x02U)
#define RTC_HOUR_HOURU_2                               (0x04U)
#define RTC_HOUR_HOURU_3                               (0x08U)
#define RTC_HOUR_HOURD_POS                             (4U)
#define RTC_HOUR_HOURD                                 (0x30U)
#define RTC_HOUR_HOURD_0                               (0x10U)
#define RTC_HOUR_HOURD_1                               (0x20U)

/*  Bit definition for RTC_WEEK register  */
#define RTC_WEEK_WEEK                                  (0x07U)

/*  Bit definition for RTC_DAY register  */
#define RTC_DAY_DAYU_POS                               (0U)
#define RTC_DAY_DAYU                                   (0x0FU)
#define RTC_DAY_DAYD_POS                               (4U)
#define RTC_DAY_DAYD                                   (0x30U)

/*  Bit definition for RTC_MON register  */
#define RTC_MON_MON                                    (0x1FU)

/*  Bit definition for RTC_YEAR register  */
#define RTC_YEAR_YEARU_POS                             (0U)
#define RTC_YEAR_YEARU                                 (0x0FU)
#define RTC_YEAR_YEARD_POS                             (4U)
#define RTC_YEAR_YEARD                                 (0xF0U)

/*  Bit definition for RTC_ALMMIN register  */
#define RTC_ALMMIN_ALMMINU_POS                         (0U)
#define RTC_ALMMIN_ALMMINU                             (0x0FU)
#define RTC_ALMMIN_ALMMIND_POS                         (4U)
#define RTC_ALMMIN_ALMMIND                             (0x70U)

/*  Bit definition for RTC_ALMHOUR register  */
#define RTC_ALMHOUR_ALMHOURU_POS                       (0U)
#define RTC_ALMHOUR_ALMHOURU                           (0x0FU)
#define RTC_ALMHOUR_ALMHOURU_0                         (0x01U)
#define RTC_ALMHOUR_ALMHOURU_1                         (0x02U)
#define RTC_ALMHOUR_ALMHOURU_2                         (0x04U)
#define RTC_ALMHOUR_ALMHOURU_3                         (0x08U)
#define RTC_ALMHOUR_ALMHOURD_POS                       (4U)
#define RTC_ALMHOUR_ALMHOURD                           (0x30U)
#define RTC_ALMHOUR_ALMHOURD_0                         (0x10U)
#define RTC_ALMHOUR_ALMHOURD_1                         (0x20U)

/*  Bit definition for RTC_ALMWEEK register  */
#define RTC_ALMWEEK_ALMWEEK                            (0x7FU)
#define RTC_ALMWEEK_ALMWEEK_0                          (0x01U)
#define RTC_ALMWEEK_ALMWEEK_1                          (0x02U)
#define RTC_ALMWEEK_ALMWEEK_2                          (0x04U)
#define RTC_ALMWEEK_ALMWEEK_3                          (0x08U)
#define RTC_ALMWEEK_ALMWEEK_4                          (0x10U)
#define RTC_ALMWEEK_ALMWEEK_5                          (0x20U)
#define RTC_ALMWEEK_ALMWEEK_6                          (0x40U)

/*  Bit definition for RTC_ERRCRH register  */
#define RTC_ERRCRH_COMP8_POS                           (0U)
#define RTC_ERRCRH_COMP8                               (0x01U)
#define RTC_ERRCRH_COMPEN_POS                          (7U)
#define RTC_ERRCRH_COMPEN                              (0x80U)

/*  Bit definition for RTC_ERRCRL register  */
#define RTC_ERRCRL_COMP                                (0xFFU)

/*  Bit definition for RTC_TPCR0 register  */
#define RTC_TPCR0_TPCT0_POS                            (0U)
#define RTC_TPCR0_TPCT0                                (0x03U)
#define RTC_TPCR0_TPCT0_0                              (0x01U)
#define RTC_TPCR0_TPCT0_1                              (0x02U)
#define RTC_TPCR0_TPNF0_POS                            (2U)
#define RTC_TPCR0_TPNF0                                (0x0CU)
#define RTC_TPCR0_TPNF0_0                              (0x04U)
#define RTC_TPCR0_TPNF0_1                              (0x08U)
#define RTC_TPCR0_TPRSTE0_POS                          (4U)
#define RTC_TPCR0_TPRSTE0                              (0x10U)
#define RTC_TPCR0_TPIE0_POS                            (5U)
#define RTC_TPCR0_TPIE0                                (0x20U)
#define RTC_TPCR0_TSTPE0_POS                           (6U)
#define RTC_TPCR0_TSTPE0                               (0x40U)
#define RTC_TPCR0_TPEN0_POS                            (7U)
#define RTC_TPCR0_TPEN0                                (0x80U)

/*  Bit definition for RTC_TPCR1 register  */
#define RTC_TPCR1_TPCT1_POS                            (0U)
#define RTC_TPCR1_TPCT1                                (0x03U)
#define RTC_TPCR1_TPCT1_0                              (0x01U)
#define RTC_TPCR1_TPCT1_1                              (0x02U)
#define RTC_TPCR1_TPNF1_POS                            (2U)
#define RTC_TPCR1_TPNF1                                (0x0CU)
#define RTC_TPCR1_TPNF1_0                              (0x04U)
#define RTC_TPCR1_TPNF1_1                              (0x08U)
#define RTC_TPCR1_TPRSTE1_POS                          (4U)
#define RTC_TPCR1_TPRSTE1                              (0x10U)
#define RTC_TPCR1_TPIE1_POS                            (5U)
#define RTC_TPCR1_TPIE1                                (0x20U)
#define RTC_TPCR1_TSTPE1_POS                           (6U)
#define RTC_TPCR1_TSTPE1                               (0x40U)
#define RTC_TPCR1_TPEN1_POS                            (7U)
#define RTC_TPCR1_TPEN1                                (0x80U)

/*  Bit definition for RTC_TPSR register  */
#define RTC_TPSR_TPF0_POS                              (0U)
#define RTC_TPSR_TPF0                                  (0x01U)
#define RTC_TPSR_TPF1_POS                              (1U)
#define RTC_TPSR_TPF1                                  (0x02U)
#define RTC_TPSR_TPOVF_POS                             (2U)
#define RTC_TPSR_TPOVF                                 (0x04U)

/*  Bit definition for RTC_SECTP register  */
#define RTC_SECTP_SECTPU_POS                           (0U)
#define RTC_SECTP_SECTPU                               (0x0FU)
#define RTC_SECTP_SECTPD_POS                           (4U)
#define RTC_SECTP_SECTPD                               (0x70U)

